In [1]:
import pandas as pd
import numpy as np

In [6]:
# creacion de un array
arreglo = np.array([[1,2,3],[4,5,6],[7,8,9]])
arreglo

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [3]:
# creacion de un dataframe
df =pd.DataFrame(arreglo)
df

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [4]:
# dar nombre a las columnas
df=pd.DataFrame(data=arreglo,index=['A','B','C'],columns=['D','E','F'])
df

   D  E  F
A  1  2  3
B  4  5  6
C  7  8  9

In [5]:
df.head(2)

   D  E  F
A  1  2  3
B  4  5  6

In [10]:
# informacion del dataframe
df.info()
df.shape   # dimensiones del dataframe
df.describe()  # estadisticas del dataframe
df.columns  # nombre de las columnas
df.index  # nombre de los indices

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, A to C
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   D       3 non-null      int32
 1   E       3 non-null      int32
 2   F       3 non-null      int32
dtypes: int32(3)
memory usage: 60.0+ bytes

Index(['A', 'B', 'C'], dtype='object')

In [12]:
df.loc['G'] =[11,12,13]  # agregar una fila
df['H']=[17,16,15,14]
df

    D   E   F   H
A   1   2   3  17
B   4   5   6  16
C   7   8   9  15
G  11  12  13  14

In [18]:
#Extraer una columna del dataframe 
#Sintaxis: df['nombre_columna'] doble corchete

df2=df[['E','H']]
df2

    E   H
A   2  17
B   5  16
C   8  15
G  12  14

In [20]:
df3=df.iloc[0:2]  # extraer filas
df3

   D  E  F   H
A  1  2  3  17
B  4  5  6  16

In [21]:
# cambio de nombre de las columnas
df.columns=['C1','C2','C3','C4']
df

   C1  C2  C3  C4
A   1   2   3  17
B   4   5   6  16
C   7   8   9  15
G  11  12  13  14

In [22]:
# cambio de alguna columna

df.rename(columns={'C1':'A','C2':'B'},inplace=True)
df

# se cambio el nombre de C1 a A y C2 a B

    A   B  C3  C4
A   1   2   3  17
B   4   5   6  16
C   7   8   9  15
G  11  12  13  14

In [23]:
# cambio de nombre de renglones o filas

df.rename(index={'A':'Dato1','B':'Dato2'},inplace=True)
df

        A   B  C3  C4
Dato1   1   2   3  17
Dato2   4   5   6  16
C       7   8   9  15
G      11  12  13  14

In [26]:
# Ordenar un dataframe ASC o DESC
df4=df.sort_values(by='C3',ascending=False)
df4

        A   B  C3  C4
G      11  12  13  14
C       7   8   9  15
Dato2   4   5   6  16
Dato1   1   2   3  17

In [27]:
df5=df.sort_values(by='C3',ascending=True)
df5

        A   B  C3  C4
Dato1   1   2   3  17
Dato2   4   5   6  16
C       7   8   9  15
G      11  12  13  14

In [28]:
# Verificacion de condiciones en un dataframe
df["B"]>5

Dato1    False
Dato2    False
C         True
G         True
Name: B, dtype: bool

In [29]:
# filtrar un dataframe
df[df["B"]>5]

    A   B  C3  C4
C   7   8   9  15
G  11  12  13  14